In [10]:
import pandas as pd
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

df  = pd.DataFrame(x)
x = df[["ID"]]
type(x)
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [11]:
z = df[['Department','Salary','ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

##### Problem 1: Create a dataframe to display the result as below:

In [12]:
import pandas as pd

data = {
    "Student": ["David","Samuel", "Terry", "Evan"],
    "age"   :   [27, 24, 22, 32],
    "Country": ["UK", "Canada", "China", "USA"],
   'Course'  : ["Python", "Data Structure", "Machine Learning ", "Web development"],
   "Marks"   : [85, 72, 89, 76] 
}
df =  pd.DataFrame(data)
df

  Student  age Country             Course  Marks
0   David   27      UK             Python     85
1  Samuel   24  Canada     Data Structure     72
2   Terry   22   China  Machine Learning      89
3    Evan   32     USA    Web development     76

In [13]:
b = df[['Marks']]
b

   Marks
0     85
1     72
2     89
3     76

In [29]:
# how to select the contry usa only usa just usa using iloc
df.iloc[3:4,2:3] #

  Country
3     USA

In [18]:
x = df['Student']
x

NameError: name 'df1' is not defined

In [17]:
type(x)

pandas.core.frame.DataFrame